Repository: jjvanzon/JJ.Framework
Catalog: Framework/Validation/Resources/ValidationResources.*.resx
Languages: nl_nl

# Contains_WithName_AndValue
source: {0} contains {1}.
nl_nl: {0} bevat {1}.

# LengthExceeded_WithName_AndLength
source: {0} is longer than {1} characters.
nl_nl: {0} is langer dan {1} tekens.

# FileAlreadyExists_WithFilePath
source: File '{0}' already exists.
nl_nl: Bestand '{0}' bestaat al.

# FileNotFound_WithFilePath
source: File '{0}' not found.
nl_nl: Bestand '{0}' bestaat niet.

# FolderAlreadyExists_WithFolderPAth
source: Folder '{0}' already exists.
nl_nl: Map '{0}' bestaat al.

# FolderNotFound_WithFolderPath
source: Folder '{0}' not found.
nl_nl: Map '{0}' niet gevonden.

# GreaterThanOrEqual_WithName_AndLimit
source: {0} should be less than {1}.
nl_nl: {0} zou lager dan {1} moeten zijn.

# GreaterThan_WithName_AndLimit
source: {0} is above {1}.
nl_nl: {0} ligt boven {1}.

# HasNulls_WithName
source: {0} has empty values.
nl_nl: {0} heeft lege waardes.

# InvalidIndex_WithName
source: {0} has an invalid number.
nl_nl: {0} is een ongelding nummer.

# Invalid_WithName
source: {0} is invalid.
nl_nl: {0} is ongeldig.

# IsBrokenNumber_WithName
source: {0} is a broken number.
nl_nl: {0} is een kommagetal.

# IsEmpty_WithName
source: {0} is empty.
nl_nl: {0} is leeg.

# IsFilledIn_WithName
source: {0} should not be filled in.
nl_nl: {0} zou niet ingevuld moeten zijn.

# IsInfinity_WithName
source: {0} is infinite.
nl_nl: {0} is oneindig.

# IsInList_WithName
source: {0} is in the list of disallowed values.
nl_nl: {0} staat in de lijst met niet-toegestane waardes.

# IsInteger_WithName
source: {0} is not an integer number.
nl_nl: {0} is geen geheel getal.

# IsNaN_WithName
source: {0} is not a number.
nl_nl: {0} is geen getal.

# IsOfType_WithName_AndTypeName
source: {0} is of type {1}.
nl_nl: {0} is van het soort {1}.

# IsZero_WithName
source: {0} is zero.
nl_nl: {0} is 0.

# LessThanOrEqual_WithName_AndLimit
source: {0} should be more than {1}.
nl_nl: {0} zou hoger dan {1} moeten zijn.

# LessThan_WithName_AndLimit
source: {0} is below {1}.
nl_nl: {0} ligt onder {1}.

# NotBrokenNumber_WithName
source: {0} is not a broken number.
nl_nl: {0} is geen kommagetal.

# NotContains_WithName_AndValue
source: {0} does not contain {1}.
nl_nl: {0} bevat geen {1}.

# NotEmpty_WithName_Singular
source: {0} is not empty.
nl_nl: {0} is niet leeg.

# NotEqual_WithName_AndValue
source: {0} is not {1}.
nl_nl: {0} is niet {1}.

# NotFilledIn_WithName
source: {0} is not filled in.
nl_nl: {0} is niet ingevuld.

# NotInList_WithName
source: {0} is not one of the allowed items.
nl_nl: {0} staat niet in de lijst van toegestane waardes.

# NotInList_WithName_AndAllowedValues
source: {0} should have one of the values: {1}.
nl_nl: {0} zou een van de volgende waardes moeten hebben: {1}.

# NotInteger_WithName
source: {0} is not an integer number.
nl_nl: {0} is geen geheel getal.

# NotOfType_WithName_AndTypeName
source: {0} is not of type {1}.
nl_nl: {0} is niet van het soort {1}.

# NotUnique_WithName_Singular
source: {0} is not unique.
nl_nl: {0} is dubbel.

# Exists_WithName
source: {0} should not exist.
nl_nl: {0} zou niet moeten bestaan.

# NotExists_WithName
source: {0} does not exist.
nl_nl: {0} bestaat niet.

# NotUnique_WithName_Plural
source: {0} are not unique.
nl_nl: {0} zijn dubbel.

# NotInList_WithName_AndValue
source: {0} {1} is not one of the allowed items.
nl_nl: {0} {1} staat niet in de lijst van toegestane waardes.

# InvalidChoice_WithName
source: {0} is an invalid choice.
nl_nl: {0} is een ongeldige keuze.

# NotBoth_WithTwoNames
source: {0} or {1} can be filled in, but not both at the same time.
nl_nl: {0} of {1} kunnen worden ingevuld, maar niet beide tegelijk.

# NotUnique_WithName_AndValue_Singular
source: {0} {1} is not unique.
nl_nl: {0} {1} is dubbel.

# NotUnique_WithName_AndDuplicateValues_Plural
source: {0} are not unique. Duplicates: {1}.
nl_nl: {0} zijn dubbel. Dubbele: {1}.

# NotUnique_WithName_AndDuplicateValues_Singular
source: {0} is not unique. Duplicates: {1}.
nl_nl: {0} is dubbel. Dubbele: {1}.

# AreEmpty_WithName
source: {0} are empty.
nl_nl: {0} zijn leeg.

# NotEmpty_WithName_Plural
source: {0} are not empty.
nl_nl: {0} zijn niet leeg.

source: Not filled in.
nl_nl: Niet ingevuld.

# NotExists_WithName_AndValue
source: {0} {1} does not exist.
nl_nl: {0} {1} bestaat niet.

# NotInList_WithName_AndValue_AndAllowedValues
source: {0} {1} not allowed. Allowed items: {2}.
nl_nl: {0} {1} niet toegestaan. Mogelijke waardes: {2}.
